[
  {
    "commonName": "Anthurium (Flamingo Lily)",
    "family": "Araceae",
    "genus": "Anthurium",
    "scientificName": "Anthurium andraeanum",
    "canFound": "This species native to Colombia and Ecuador. Also can found in Malaysia",
    "description": "Anthurium andraeanum or Flamingo Lily is a herbaceous evergreen plant that grows to 40 cm in height. The dark green leaves are heart-shaped and glossy. The inflorescence is made up of a cream yellow tail-like spadix and waxy red spathe. Coupled with frequent blooming and tolerance to partial shade, it is cultivated to produce various colours and sizes of spathe, making Flamingo Lily a popular houseplant.",
    "category": "herbs",
    "imageName": "anthurium",
    "healthStatus": "Healthy",
    "suggestion": "Keep up the great work! Your plant is thriving."
  },
  {
    "commonName": "Peace Lily",
    "family": "Araceae",
    "genus": "Spathiphyllum",
    "scientificName": "Spathiphyllum wallisii",
    "canFound": "Native to tropical regions of the Americas and southeastern Asia.",
    "description": "A very popular indoor houseplant, it is a clump-growing herbaceous perennial which produces white flowers which look like the hood of a cobra. Leaves are glossy and dark green. A great plant for air-purifying.",
    "category": "flowers",
    "imageName": "peace_lily",
    "healthStatus": "Needs Attention",
    "suggestion": "The leaves are yellowing. This could be due to overwatering. Let the soil dry out before watering again."
  },
  {
    "commonName": "Rose",
    "family": "Rosaceae",
    "genus": "Rosa",
    "scientificName": "Rosa spp.",
    "canFound": "Native to Asia, with smaller numbers native to Europe, North America, and northwestern Africa.",
    "description": "A woody perennial flowering plant of the genus Rosa, in the family Rosaceae. There are over three hundred species and tens of thousands of cultivars. They form a group of plants that can be erect shrubs, climbing, or trailing, with stems that are often armed with sharp prickles.",
    "category": "flowers",
    "imageName": "rose",
    "healthStatus": "Diseased",
    "suggestion": "Black spots on the leaves are a sign of a fungal infection. Remove the affected leaves and apply a fungicide."
  },
  {
    "commonName": "Fragrant Ginger",
    "family": "Zingiberaceae",
    "genus": "Zingiber",
    "scientificName": "Zingiber officinale",
    "canFound": "This species is native to maritime Southeast Asia.",
    "description": "A flowering plant whose rhizome, ginger root or ginger, is widely used as a spice and a folk medicine. It is a herbaceous perennial which grows annual pseudostems about one meter tall bearing narrow leaf blades.",
    "category": "herbs",
    "imageName": "fragrant_ginger",
    "healthStatus": "Healthy",
    "suggestion": "Your ginger plant is looking great! Continue providing it with plenty of sunlight and regular watering."
  },
  {
    "commonName": "King of Bitters",
    "family": "Acanthaceae",
    "genus": "Andrographis",
    "scientificName": "Andrographis paniculata",
    "canFound": "found across tropical and subtropical Asia, native to Taiwan, China, and India, thriving in warm, humid climates in places like Southeast Asia (Malaysia, Thailand, Indonesia, Vietnam), Sri Lanka, and the Caribbean. It grows wild in diverse lowland habitats (roadsides, fields, forests) up to 1600m elevation and is extensively cultivated for its significant medicinal uses in traditional systems like Ayurveda and Chinese medicine. ",
    "description": "•\tUses in Local Traditional Medicine:\n• The leaves and stems are used to prepare herbal remedies for fever caused by insect bites.\n• Decoctions from the plant are traditionally consumed to help manage diabetes and support digestive health, including relief from appendicitis.\n• Infusions are applied to reduce symptoms of typhus and to alleviate swelling in the feet.\n• Crushed leaves or pastes are used topically to treat scabies and other skin irritations.\n•\tUses Supported by Experimental and or Clinical Data\n• Antimicrobial activity: Aqueous extract, and arabinogalactan proteins against Bacillus\nsubtilis, Escherichia coli, Pseudomonas aeruginosa and Candida albicans.\n• Anti-inflammatory/anti-allergic activity: Aqueous and methanol extracts (leaves)\nsignificant alleviation of lipopolysaccharide induced release of pro-inflammatory\nmediators (NO, IL-1β and 1L-6), inflammatory mediators (PGE2 and TXB2) and allergic\nmediators (LTB4).\n• Immunostimulant activity: Ethanol extracts of the fresh plants and purified diterpenes\n–andrographolide and neoandrographolide induced significant (P < 0.001) stimulation\nof antibody and delayed hyper sensitivity response to sheep blood cells in mice.\n• Anti-protozoan, anti-inflammatory, anti-oxidant, immuno-stimulant, antidiabetic, antiangiogenic, hepato-renal protective, sex hormone modulatory, liver enzymes\nmodulatory and insecticidal and toxicity activities.\n\n\n•\tOther Notes: This annual herb is commonly found in open fields and along roadside areas. Its quadrangular stems with enlarged nodes make it easy to identify, while its small tubular-lipped flowers attract pollinators, aiding in natural propagation.\n",
    "category": "herbs",
    "imageName": "bitters",
    "healthStatus": "Healthy",
    "suggestion": "Your ginger plant is looking great! Continue providing it with plenty of sunlight and regular watering."
  },
  {
    "commonName": "Hibiscus / Bunga Raya",
    "family": "Malvacae",
    "genus": "Hibiscus",
    "scientificName": "Hibiscus rosa-sinensis",
    "canFound": "Widely cultivated throughout Malaysia in home gardens, school compounds, parks, and along roadsides; thrives in tropical lowlands.",
    "description": "- Growth habit: A perennial evergreen shrub that can grow 2–4 m tall with woody stems and dense branching.\n- Leaves: Glossy, dark green, ovate leaves with serrated margins arranged alternately along the stems.\n- Flowers: Large, showy flowers with five petals, most commonly red; flowers are short-lived but produced continuously throughout the year.\n- Uses in Local Traditional Practice:\n•\tThe flowers are crushed and mixed with water or oil to make a natural hair conditioner, believed to promote hair growth and reduce dandruff.\n•\tLeaf paste is sometimes applied to boils or minor skin irritations to soothe inflammation.\n•\tFlower infusions are traditionally consumed as a cooling drink to reduce body heat.\n- Other Notes:\n•\tRecognized as the national flower of Malaysia, symbolizing courage and unity.\n•\tCommonly planted for ornamental and cultural purposes; attracts butterflies and pollinators.\n",
    "category": "shrubs",
    "imageName": "hibiscus",
    "healthStatus": "Diseased",
    "suggestion": "Black spots on the leaves are a sign of a fungal infection. Remove the affected leaves and apply a fungicide."
  },
  {
    "commonName": "Blood Flower/ Bunga Rama-rama",
    "family": "Apocynaceae",
    "genus": "Asclepias",
    "scientificName": "Asclepias curassavica",
    "canFound": "Found in gardens, roadsides, and open fields; commonly planted in butterfly gardens across Malaysia.",
    "description": "- Growth habit: An upright perennial shrub reaching about 1–1.5 m in height.\n- Leaves: Narrow, lance-shaped leaves arranged oppositely along the stem; bright green in color.\n- Flowers: Small but vibrant clusters of red and orange flowers with a distinctive crown-like structure.\n- Latex: Produces a milky sap when cut, characteristic of the family.\n- Uses in Local Traditional Medicine:\n•\tLeaf decoctions have been used cautiously in folk remedies for fever and digestive discomfort.\n•\tCrushed leaves are sometimes applied externally to treat skin parasites or fungal infections.\n- Other Notes:\n•\tHighly attractive to butterflies, especially the Plain Tiger and Monarch.\n•\tCaution: The milky sap is toxic if ingested in large quantities and should be handled carefully.\n",
    "category": "shrubs",
    "imageName": "blood",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Painted Nettle/Ati-ati/ Pokok Hiasan Daun",
    "family": "Lamiaceae",
    "genus": "Coleus",
    "scientificName": "Coleus scutellarioides",
    "canFound": "Commonly grown as an ornamental plant in pots, home gardens, and landscaped areas; prefers shaded or semi-shaded environments.",
    "description": "Growth habit: A low-growing, bushy perennial shrub with soft, square stems.\n\nLeaves: Broad, soft leaves with striking variegated colors including purple, red, green, and yellow; leaf margins may be serrated.\n\nFlowers: Small, pale blue or lavender flowers arranged on terminal spikes, though often removed to enhance leaf growth.\n\nUses in Local Traditional Practice:\n\nLeaves are crushed and applied to minor wounds, bruises, or insect bites to reduce swelling.\n\nLeaf infusions are traditionally used for stomach discomfort and mild coughs.\n\nOther Notes:\n\nValued primarily for its decorative foliage rather than flowers.\n\nEasy to propagate through stem cuttings, making it popular among home gardeners.\n",
    "category": "shrubs",
    "imageName": "painted",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Black Bat Flower/ Bunga Kelawar Hitam",
    "family": "Dioscoreaceae",
    "genus": "Tacca",
    "scientificName": "Tacca chantrieri",
    "canFound": "Naturally occurs in shaded tropical rainforests of Southeast Asia; in Malaysia, found in forest understories and sometimes cultivated as an ornamental plant.",
    "description": "Rhizome:\n\nDevelops an underground rhizome that stores nutrients and enables survival in shaded forest conditions.\n\nLeaves: Large, glossy, lance-shaped leaves that emerge directly from the base.\n\nFlowers: Unique dark purple to black flowers resembling a bat, with long whisker-like bracts extending up to 60 cm.\n\nUses in Local Traditional Medicine:\n\nRhizomes are boiled to prepare decoctions traditionally used to reduce fever and fatigue.\n\nGround rhizome paste may be applied externally for skin conditions or swelling.\n\nOther Notes:\n\nConsidered a rare and exotic ornamental plant due to its unusual flower structure.\n\nThrives in humid, shaded environments with well-drained soil.\n",
    "category": "shrubs",
    "imageName": "bat",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Meranti",
    "family": "Dipterocarpaceae",
    "genus": "Shorea",
    "scientificName": "Shorea spp.",
    "canFound": "Widespread in lowland and hill dipterocarp forests throughout Peninsular Malaysia, Sabah, and Sarawak.",
    "description": "Growth habit: Large emergent tropical hardwood trees, often reaching 40–60 m in height with straight cylindrical trunks.\n\nBark: Varies by species; generally grey to reddish-brown, fissured or flaky.\n\nLeaves: Simple, alternate, leathery leaves with prominent veins.\n\nFlowers & fruits: Small flowers; winged fruits adapted for wind dispersal, characteristic of dipterocarps.\n\nUses in Local Traditional Practice:\n\nResin (damar) from certain species is used as a traditional torch fuel and waterproofing agent.\n\nBark decoctions are sometimes used in folk remedies for stomach ailments.\n\nOther Notes:\n\nShorea species are among the most economically important timber trees in Malaysia.\n\nMany species are threatened due to logging and habitat loss.\n\nDominant canopy trees that play a critical role in forest ecology.\n",
    "category": "trees",
    "imageName": "meranti",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Tualang/ Tapang/ Mangaris",
    "family": "Fabaceae",
    "genus": "Koompassia",
    "scientificName": "Koompassia excelsa",
    "canFound": "Lowland tropical rainforests of Peninsular Malaysia, Sabah, and Sarawak; often growing near riverbanks.",
    "description": "Growth habit: One of the tallest tropical trees, reaching heights of 70–90 m with massive buttress roots.\n\nTrunk: Tall, straight, and usually branchless for a great height.\n\nLeaves: Bipinnate compound leaves with small leaflets.\n\nFlowers: Small, pale yellow-white flowers arranged in clusters.\n\nUses in Local Traditional Practice:\n\nBark extracts are traditionally used in small amounts as a tonic to restore strength.\n\nWood was historically used for canoes and structural components.\n\nOther Notes:\n\nFamous for hosting giant honey bee (Apis dorsata) nests, making it culturally important for honey harvesting.\n\nConsidered a keystone species in forest ecosystems.\n\nTimber is extremely hard but difficult to process.\n",
    "category": "trees",
    "imageName": "tualang",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Merbau",
    "family": "Fabaceae",
    "genus": "Intsia",
    "scientificName": "Intsia palembanica",
    "canFound": "Lowland forests, coastal forests, and riverine areas in Peninsular Malaysia, Sabah, and Sarawak.",
    "description": "Growth habit: Large evergreen hardwood tree reaching 40–50 m tall.\n\nTrunk: Straight with a broad crown; bark dark brown and rough.\n\nLeaves: Compound leaves with thick, glossy leaflets.\n\nFlowers: Small, yellowish-white flowers arranged in panicles.\n\nUses in Local Traditional Practice:\n\nBark decoctions are traditionally used to treat diarrhea and dysentery.\n\nWood shavings are sometimes soaked and used in herbal baths for post-illness recovery.\n\nOther Notes:\n\nHighly valued for its durable, termite-resistant timber.\n\nWidely used in flooring, bridges, and heavy construction.\n\nClassified as vulnerable due to overexploitation.\n",
    "category": "trees",
    "imageName": "merbau",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Chengal",
    "family": "Dipterocarpaceae",
    "genus": "Neobalanocarpus",
    "scientificName": "Neobalanocarpus heimii",
    "canFound": "Endemic to Peninsular Malaysia, especially in lowland and hill dipterocarp forests.",
    "description": "Growth habit: Large emergent hardwood tree reaching 50–60 m in height.\n\nTrunk: Straight with well-developed buttress roots; bark dark brown and deeply fissured.\n\nLeaves: Simple, thick, glossy leaves with entire margins.\n\nFlowers & fruits: Small flowers; winged fruits typical of dipterocarps.\n\nUses in Local Traditional Practice:\n\nResin is sometimes used as a sealing agent for boats and tools.\n\nBark infusions are traditionally used for treating minor infections.\n\nOther Notes:\n\nConsidered Malaysia’s most durable timber, highly resistant to rot and insects.\n\nFrequently used in traditional Malay houses, bridges, and railway sleepers.\n\nA slow-growing species, making conservation important.\n",
    "category": "trees",
    "imageName": "chengal",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Climbing Bauhinia/ Bunga Tapak Kuda Merah",
    "family": "Fabaceae",
    "genus": "Bauhinia",
    "scientificName": "Bauhinia kockiana",
    "canFound": "Commonly cultivated in gardens, parks, pergolas, and along fences in Malaysia; prefers sunny to partially shaded areas.",
    "description": "Growth habit: A vigorous woody climber or scrambling shrub that can climb several meters with support.\n\nStems: Slender, twining stems that spread over trellises and structures.\n\nLeaves: Distinctive bilobed leaves resembling a camel’s hoof, bright green and leathery.\n\nFlowers: Large, showy, deep red to crimson flowers with long stamens, blooming profusely.\n\nUses in Local Traditional Practice:\n\nLeaf decoctions are sometimes used in folk remedies to relieve mild coughs and fever.\n\nCrushed leaves may be applied externally to minor skin irritations.\n\nOther Notes:\n\nWidely planted for ornamental value due to its striking flowers.\n\nAttracts butterflies and other pollinators.\n\nRequires regular pruning to control vigorous growth.\n",
    "category": "climbers",
    "imageName": "bauhina",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Wild Betel/ Sirih Hutan",
    "family": "Piperaceae",
    "genus": "Piper",
    "scientificName": "Piper argyrites",
    "canFound": "Found in lowland tropical forests, forest margins, and shaded areas; occasionally cultivated near rural homes.",
    "description": "GGrowth habit: A perennial woody climber that ascends trees and other supports.\n\nStems: Flexible, jointed stems with nodes capable of producing adventitious roots.\n\nLeaves: Broad, heart-shaped leaves with silvery or pale green markings and prominent veins.\n\nFlowers: Small, inconspicuous flowers arranged on slender spike-like inflorescences.\n\nUses in Local Traditional Medicine:\n\nLeaves are chewed or boiled to prepare decoctions for treating coughs and colds.\n\nLeaf poultices are applied to reduce swelling or relieve headaches.\n\nOther Notes:\n\nBelongs to the same genus as Piper betle (sirih), widely known in Malay culture.\n\nValued for its medicinal properties rather than ornamental appeal.\n",
    "category": "climbers",
    "imageName": "betel",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Lipstick Plant/ Pokok Gincu",
    "family": "Gesneriaceae",
    "genus": "Aeschynanthus",
    "scientificName": "Aeschynanthus spp.",
    "canFound": "Native to tropical forests of Malaysia, especially in shaded, humid environments; commonly grown as hanging ornamental plants.",
    "description": "Growth habit: An epiphytic or trailing climber that grows on tree trunks or rocks.\n\nStems: Soft, trailing stems that hang or climb with support.\n\nLeaves: Thick, fleshy, dark green leaves that store moisture.\n\nFlowers: Tubular red flowers emerging from dark maroon calyces, resembling lipstick.\n\nUses in Local Traditional Practice:\n\nLimited medicinal use; occasionally used in folk remedies as a mild cooling plant.\n\nOther Notes:\n\nHighly valued as an ornamental plant for its unique flowers.\n\nPrefers indirect light and high humidity.\n\nAttracts sunbirds and insects for pollination.\n",
    "category": "climbers",
    "imageName": "lipstik",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Silky Afgekia",
    "family": "Fabaceae",
    "genus": "Afgekia",
    "scientificName": "Afgekia sericea",
    "canFound": "Cultivated in botanical gardens and arboretums; native to parts of Southeast Asia and grown in suitable tropical conditions in Malaysia.",
    "description": "Growth habit: A woody twining climber that grows vigorously with support.\n\nStems: Slender, climbing stems that twine around trellises and trees.\n\nLeaves: Pinnate leaves covered with fine silky hairs, giving a soft texture.\n\nFlowers: Showy pea-shaped flowers in shades of lavender, purple, or pale blue arranged in hanging clusters.\n\nUses in Local Traditional Practice:\n\nRoots and leaves are occasionally used in traditional remedies for fatigue and general weakness.\n\nOther Notes:\n\nOften referred to as the “Malaysian Wisteria” due to its resemblance to wisteria flowers.\n\nPlanted mainly for ornamental and landscape purposes.\n\nRequires strong support structures for optimal growth.\n",
    "category": "climbers",
    "imageName": "silky",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Rangoon Creeper/ Akar Dani/ Pokok China Rose",
    "family": "Combretaceae",
    "genus": "Combretum",
    "scientificName": "Combretum indicum",
    "canFound": "Commonly cultivated in home gardens, along fences, pergolas, and park structures throughout Malaysia.",
    "description": "Growth habit: A vigorous woody creeper or climbing shrub that can grow several meters with support.\n\nStems: Long, flexible stems that sprawl or climb over structures.\n\nLeaves: Simple, opposite, oval-shaped leaves with smooth margins.\n\nFlowers: Fragrant tubular flowers borne in clusters; flowers change color from white to pink and finally deep red as they age.\n\nUses in Local Traditional Practice:\n\nFlower infusions are traditionally used as a mild tonic to improve general well-being.\n\nLeaf decoctions are sometimes used to relieve coughs and fever.\n\nOther Notes:\n\nWidely planted for its fragrance and ornamental appeal.\n\nAttracts butterflies and bees.\n\nRequires regular pruning to control its rapid growth.\n",
    "category": "creepers",
    "imageName": "rangon",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Peacock Flower/ Bunga Tapak Kuda Merah",
    "family": "Fabaceae",
    "genus": "Bauhinia",
    "scientificName": "Bauhinia kockiana",
    "canFound": "Cultivated as a creeper along fences, trellises, and garden walls across Malaysia.",
    "description": "Growth habit: A woody creeper or scrambling climber that spreads widely when supported.\n\nStems: Twining and sprawling branches capable of covering large surfaces.\n\nLeaves: Bilobed, camel-hoof-shaped leaves that are leathery and bright green.\n\nFlowers: Large, deep red, showy flowers with long protruding stamens.\n\nUses in Local Traditional Practice:\n\nLeaf preparations are occasionally used to reduce mild inflammation.\n\nCrushed leaves may be applied to insect bites.\n\nOther Notes:\n\nPopular for landscape beautification due to its dramatic flowers.\n\nLow maintenance and fast growing.\n\nCommonly used as a living fence or wall cover.\n",
    "category": "creepers",
    "imageName": "peacock",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Balek Adap/ Bunga Nusa Indah",
    "family": "Rubiaceae",
    "genus": "Mussaenda",
    "scientificName": "Mussaenda spp",
    "canFound": "Widely planted in Malaysian gardens, roadsides, and public landscapes; grows well in tropical lowland areas.",
    "description": "Growth habit: A spreading shrub that can behave as a creeper when unsupported.\n\nStems: Soft, flexible branches that may trail along the ground.\n\nLeaves: Large, ovate leaves with a soft texture.\n\nFlowers: Small yellow or orange flowers accompanied by enlarged, colorful bracts (white, pink, or red).\n\nUses in Local Traditional Practice:\n\nLeaf decoctions are used to reduce fever and treat minor infections.\n\nCrushed leaves are applied externally to wounds to promote healing.\n\nOther Notes:\n\nValued for its long flowering period and colorful bracts.\n\nCommon in ornamental landscaping.\n\nAttracts butterflies and pollinating insects.\n",
    "category": "creepers",
    "imageName": "balek",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Blue Trumpet Vine/ Bunga Biru",
    "family": "Acanthaceae",
    "genus": "Thunbergia",
    "scientificName": "Thunbergia laurifolia",
    "canFound": "Commonly cultivated in gardens, along fences, and pergolas; thrives in sunny tropical conditions throughout Malaysia.",
    "description": "Growth habit: A fast-growing perennial creeper with long trailing or climbing stems.\n\nStems: Flexible, green stems that twine around supports.\n\nLeaves: Large, lance-shaped to ovate leaves with smooth margins.\n\nFlowers: Large, trumpet-shaped blue to violet flowers with a pale yellow throat.\n\nUses in Local Traditional Medicine:\n\nLeaves are boiled to prepare herbal drinks believed to detoxify the body.\n\nLeaf infusions are traditionally used to treat fever and reduce inflammation.\n\nOther Notes:\n\nCommonly planted for shade and ornamental coverage.\n\nPopular in traditional herbal practices.\n\nAttracts bees, butterflies, and birds.\n",
    "category": "creepers",
    "imageName": "trumpet",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Kachip Patimah",
    "family": "Myrsinaceae",
    "genus": "Labisia",
    "scientificName": "Labisia pumila",
    "canFound": "commonly found in the shady floors of rainforests in Malaysia, Indonesia, Singapore, Thailand, Borneo, Sumatra, Java, Sulawesi, Maluku, and New Guinea, growing from sea level up to higher altitudes, known for its use in traditional medicine for women's health.",
    "description": "-\tUses Supported by Experimental and or Clinical Data\n• Phytoestrogenic effect, antioxidant and antiaging, antibacterial and antifungal, anticarcinogenic.\n-\tUses in Local Traditional Medicine:\n• The decoction of the plant is commonly consumed during childbirth to facilitate labour and is also used as a tonic during post-partum confinement to promote recovery.\n• Traditionally employed in the treatment of dysentery, flatulence, rheumatism, gonorrhoea, and dysmenorrhoea.\n• Used as a folk remedy to relieve gastric discomfort, aid in healing internal injuries, enhance fertility, and help regulate blood sugar levels and blood pressure.\n-\tOther Notes: This small herbaceous under-shrub, reaching up to 50 cm in height, is often found in grasslands or forest edges. Its finely toothed leaves with numerous veins, along with its small white or pink flowers arranged in spine-like panicles, make it easily distinguishable. The globose berries, about 5 mm in diameter, turn bright red when ripe, serving as an indicator of seed maturity and attracting birds for seed dispersal.\n",
    "category": "herbs",
    "imageName": "patimah",
    "healthStatus": "",
    "suggestion": ""
  },
  {
    "commonName": "Lemuni Hitam",
    "family": "Lamiaceae",
    "genus": "Vitex",
    "scientificName": "Vitex negundo",
    "canFound": "across tropical and subtropical regions of Asia (India, China, Philippines, Malaysia, Sri Lanka) and Africa, thriving in grasslands, disturbed areas, and near water, often used in traditional medicine for pain, inflammation, and respiratory issues.",
    "description": "-\tUses Supported by Experimental and or Clinical Data\n•\tAnti-inflammatory , analgesic, antioxidant activities\n•\tInterference with male reproductive functions in rats. Estrogen like activity, and can be use as hormone replacement therapy\n•\tPotential myocardial infarction treatment\n•\tToxic to selected human cancer cell lines\n•\tHepato-protective activity against d-galactose amine and carbon tetrachloride induced damages\n-\tUses in Local Traditional Medicine\n•\tLeaves: Aromatic bath, insectifuge, wound healing\n•\tLeaves and root : Tonic, febrifuge (India)\n•\tBark & leaves decoction : anti-gastralgic (Philippines)\n•\tSwelling, flatulence fevers, cough, snake bite / poison antidote (Sri Lanka)\n•\tCough and sore throats (Papua New Guinea)\n•\tOther notes: Multi-trunked tree up to 15' tall. Leaves: Grayish-green, compound palmate, with 3-5 lance-shaped leaflets (each leaflet up to 4\" long). Flowers: Bluish-lavender coloured, tiny, fragrant appearing in loose, 5-8\" long panicles.\n",
    "category": "herbs",
    "imageName": "lemuni",
    "healthStatus": "",
    "suggestion": ""
  }
]